MissouriMRDT/BMS_Software/libraries/RoveBoard/tm4c1294ncpdt_API/RoveADC/RoveADC_TivaTM4C1294NCPDT.cpp
/*
 * RoveADC_TivaTM4C1294NCPDT.cpp
 *
 *  Created on: Oct 27, 2017
 *      Author: drue
 */

#include "../Clocking/Clocking_TivaTM4C1294NCPDT.h"
#include "../RovePinMap_TivaTM4C1294NCPDT.h"
#include "supportingUtilities/Debug.h"
#include "supportingUtilities/RoveUtilities.h"
#include "../tivaware/inc/hw_memmap.h"
#include "../tivaware/inc/hw_types.h"
#include "../tivaware/inc/hw_adc.h"
#include "../tivaware/inc/hw_gpio.h"
#include "../tivaware/inc/hw_ints.h"
#include "../tivaware/driverlib/adc.h"
#include "../tivaware/driverlib/interrupt.h"
#include "../tivaware/driverlib/sysctl.h"
#include "../tivaware/driverlib/gpio.h"
#include "../tivaware/driverlib/pin_map.h"
#include "RoveADC_TivaTM4C1294NCPDT.h"

//If you try to make a conversion with the FIFO full, you'll get an overflow error. If you call getConvResult with nothing in the FIFO, you get an underflow error.
//These errors are both completely avoidable by checking the EMPTY and FULL bits before getConvResult and startConv respectively.
//Index into this with channel_number * 3 for pin and port info to set up. SYSCYTL_PERIPH_THING is just THING_BASE + 0xB0000000, but we have plenty of memory and asking the user to remember this conversion is stupid. If we need the space, we'll just create a macro to do it.
//Offset 0 is the GPIO port base, offset 1 is the SYSCTL'd version, and offset 2 is the pin number.

const uint8_t NotAChan = 25;

const uint32_t pin_to_adc_chan[] =
{
  NotAChan,          // dummy
  NotAChan,          // 01 - 3.3v       X8_01
  9,            // 02 - PE_4       X8_03
  NotAChan,            // 03 - PC_4       X8_05
  NotAChan,            // 04 - PC_5       X8_07
  NotAChan,            // 05 - PC_6       X8_09
  8,            // 06 - PE_5       X8_11
  12,            // 07 - PD_3       X8_13
  NotAChan,            // 08 - PC_7       X8_15
  NotAChan,            // 09 - PB_2       X8_17
  NotAChan,            // 10 - PB_3       X8_19
  NotAChan,            // 11 - PP_2       X9_20
  NotAChan,            // 12 - PN_3       X9_18
  NotAChan,            // 13 - PN_2       X9_16
  15,            // 14 - PD_0       X9_14
  14,            // 15 - PD_1       X9_12
  NotAChan,          // 16 - RST        X9_10
  NotAChan,            // 17 - PH_3       X9_08
  NotAChan,            // 18 - PH_2       X9_06
  NotAChan,            // 19 - PM_3       X9_04
  NotAChan,          // 20 - GND        X9_02
  NotAChan,          // 21 - 5v         X8_02
  NotAChan,          // 22 - GND        X8_04
  3,            // 23 - PE_0       X8_06
  2,            // 24 - PE_1       X8_08
  1,            // 25 - PE_2       X8_10
  0,            // 26 - PE_3       X8_12
  4,            // 27 - PD_7       X8_14
  NotAChan,            // 28 - PA_6       X8_16
  NotAChan,            // 29 - PM_4       X8_18
  NotAChan,            // 30 - PM_5       X8_20
  NotAChan,            // 31 - PL_3       X9_19
  NotAChan,            // 32 - PL_2       X9_17
  NotAChan,            // 33 - PL_1       X9_15
  NotAChan,            // 34 - PL_0       X9_13
  NotAChan,            // 35 - PL_5       X9_11
  NotAChan,            // 36 - PL_4       X9_09
  NotAChan,            // 37 - PG_0       X9_07
  NotAChan,            // 38 - PF_3       X9_05
  NotAChan,            // 39 - PF_2       X9_03
  NotAChan,            // 40 - PF_1       X9_01
  NotAChan,          // 41 - 3.3v       X6_01
  13,            // 42 - PD_2       X6_03
  NotAChan,            // 43 - PP_0       X6_05
  NotAChan,            // 44 - PP_1       X6_07
  7,            // 45 - PD_4       X6_09
  6,            // 46 - PD_5       X6_11
  NotAChan,            // 47 - PQ_0       X6_13
  NotAChan,            // 48 - PP_4       X6_15
  NotAChan,            // 49 - PN_5       X6_17
  NotAChan,            // 50 - PN_4       X6_19
  NotAChan,            // 51 - PM_6       X7_20
  NotAChan,            // 52 - PQ_1       X7_18
  NotAChan,            // 53 - PP_3       X7_16
  NotAChan,            // 54 - PQ_3       X7_14
  NotAChan,            // 55 - PQ_2       X7_12
  NotAChan,          // 56 - RESET      X7_10
  NotAChan,            // 57 - PA_7       X7_08
  NotAChan,            // 58 - PP_5       X7_06
  NotAChan,            // 59 - PM_7       X7_04
  NotAChan,          // 6Z - GND        X7_02
  NotAChan,          // 61 - 5v         X6_02
  NotAChan,          // 62 - GND        X6_04
  10,            // 63 - PB_4       X6_06
  11,            // 64 - PB_5       X6_08
  16,            // 65 - PK_0       X6_10
  17,            // 66 - PK_1       X6_12
  18,            // 67 - PK_2       X6_14
  19,            // 68 - PK_3       X6_16
  NotAChan,            // 69 - PA_4       X6_18
  NotAChan,            // 70 - PA_5       X6_20
  NotAChan,            // 71 - PK_7       X7_19
  NotAChan,            // 72 - PK_6       X7_17
  NotAChan,            // 73 - PH_1       X7_15
  NotAChan,            // 74 - PH_0       X7_13
  NotAChan,            // 75 - PM_2       X7_11
  NotAChan,            // 76 - PM_1       X7_09
  NotAChan,            // 77 - PM_0       X7_07
  NotAChan,            // 78 - PK_5       X7_05
  NotAChan,            // 79 - PK_4       X7_03
  NotAChan,            // 80 - PG_1       X7_01
  NotAChan,            // 81 - PN_1       LED1
  NotAChan,            // 82 - PN_0       LED2
  NotAChan,            // 83 - PF_4       LED3
  NotAChan,            // 84 - PF_0       LED4
  NotAChan,            // 85 - PJ_0       USR_SW1
  NotAChan,            // 86 - PJ_1       USR_SW2
  5,            // 87 - PD_6       AIN5
  NotAChan,            // 88 - PA_0       JP4
  NotAChan,            // 89 - PA_1       JP5
  NotAChan,            // 90 - PA_2       X11_06
  NotAChan,            // 91 - PA_3       X11_08
  NotAChan,            // 92 - PL_6       unrouted
  NotAChan,            // 93 - PL_7       unrouted
  NotAChan,            // 94 - PB_0       X11_58
  NotAChan,            // 95 - PB_1       unrouted
};

const uint32_t adc_chan_sysctl[20] = {
  SYSCTL_PERIPH_GPIOE, SYSCTL_PERIPH_GPIOE, SYSCTL_PERIPH_GPIOE, SYSCTL_PERIPH_GPIOE,
  SYSCTL_PERIPH_GPIOD, SYSCTL_PERIPH_GPIOD, SYSCTL_PERIPH_GPIOD, SYSCTL_PERIPH_GPIOD,
  SYSCTL_PERIPH_GPIOE, SYSCTL_PERIPH_GPIOE,
  SYSCTL_PERIPH_GPIOB, SYSCTL_PERIPH_GPIOB,
  SYSCTL_PERIPH_GPIOD, SYSCTL_PERIPH_GPIOD, SYSCTL_PERIPH_GPIOD, SYSCTL_PERIPH_GPIOD,
  SYSCTL_PERIPH_GPIOK, SYSCTL_PERIPH_GPIOK, SYSCTL_PERIPH_GPIOK, SYSCTL_PERIPH_GPIOK
};

