MissouriMRDT/BMS_Software/libraries/RoveBoard/tm4c1294ncpdt_API/RoveADC/RoveADC_TivaTM4C1294NCPDT.cpp
const uint8_t adc_chan_pin[20] = {
  GPIO_PIN_3, GPIO_PIN_2, GPIO_PIN_1, GPIO_PIN_0,
  GPIO_PIN_7, GPIO_PIN_6, GPIO_PIN_5, GPIO_PIN_4,
  GPIO_PIN_5, GPIO_PIN_4,
  GPIO_PIN_4, GPIO_PIN_5,
  GPIO_PIN_3, GPIO_PIN_2, GPIO_PIN_1, GPIO_PIN_0,
  GPIO_PIN_0, GPIO_PIN_1, GPIO_PIN_2, GPIO_PIN_3,
};

const uint32_t adc_chan_base[20] = {
  GPIO_PORTE_AHB_BASE, GPIO_PORTE_AHB_BASE, GPIO_PORTE_AHB_BASE, GPIO_PORTE_AHB_BASE,
  GPIO_PORTD_AHB_BASE, GPIO_PORTD_AHB_BASE, GPIO_PORTD_AHB_BASE, GPIO_PORTD_AHB_BASE,
  GPIO_PORTE_AHB_BASE, GPIO_PORTE_AHB_BASE,
  GPIO_PORTD_AHB_BASE, GPIO_PORTD_AHB_BASE, GPIO_PORTD_AHB_BASE, GPIO_PORTD_AHB_BASE,
  GPIO_PORTB_AHB_BASE, GPIO_PORTB_AHB_BASE,
  GPIO_PORTK_BASE, GPIO_PORTK_BASE, GPIO_PORTK_BASE, GPIO_PORTK_BASE,
  };
const uint32_t adc_chans[20] = { //This may look odd, but everything above 15 has 0xF0 added and this is less computation.
  ADC_CTL_CH0, ADC_CTL_CH1, ADC_CTL_CH2, ADC_CTL_CH3,
  ADC_CTL_CH4, ADC_CTL_CH5, ADC_CTL_CH6, ADC_CTL_CH7,
  ADC_CTL_CH8, ADC_CTL_CH9, ADC_CTL_CH10, ADC_CTL_CH11,
  ADC_CTL_CH12, ADC_CTL_CH13, ADC_CTL_CH14, ADC_CTL_CH15,
  ADC_CTL_CH16, ADC_CTL_CH17, ADC_CTL_CH18, ADC_CTL_CH19
};

//const uint32_t adc0_ints[4] = {INT_ADC0SS0, INT_ADC0SS1, INT_ADC0SS2, INT_ADC0SS3};

//const uint32_t adc1_ints[4] = {INT_ADC1SS0, INT_ADC1SS1, INT_ADC1SS2, INT_ADC1SS3};

//const uint32_t adc_int_flags[4] = {ADC_INT_SS0, ADC_INT_SS1, ADC_INT_SS2, ADC_INT_SS3};

const uint32_t adc_ssfstat[4] = {ADC_O_SSFSTAT0, ADC_O_SSFSTAT1, ADC_O_SSFSTAT2, ADC_O_SSFSTAT3};

//const uint32_t adc_dma_int_flags[4] = {ADC_INT_DMA_SS0, ADC_INT_DMA_SS1, ADC_INT_DMA_SS2, ADC_INT_DMA_SS3};

//const uint32_t adc_dcon_int_flags[4] = {ADC_INT_DCON_SS0, ADC_INT_DCON_SS1, ADC_INT_DCON_SS2, ADC_INT_DCON_SS3};

#define STEP0 0x01
#define STEP1 0x02
#define STEP2 0x04
#define STEP3 0x08
#define STEP4 0x10
#define STEP5 0x20
#define STEP6 0x40
#define STEP7 0x80

#define PLLVCO ADC_CLOCK_SRC_PLL
#define PIOSC ADC_CLOCK_SRC_PIOSC
#define ALTCLK ADC_CLOCK_SRC_ALTCLK
#define MOSC ADC_CLOCK_SRC_MOSC

#define DEFAULT_ADC_CLK_SPEED 32000000
#define DEFAULT_ADC_SAMPLE_CYCLES 16 //at 16 nsh, we get about 1 million samples per second and allow up to about 10Kohm of external resistance.
#define SEQ_DELAY_FACTOR_MICROS 500 //how many microseconds we want to pass where if the user asks, a sequencer will just return its last reading
#define MAX_CHANS 20

#define SEQ0_LEN  8
#define SEQ1_LEN 4
#define SEQ2_LEN 4
#define SEQ3_LEN 1

typedef enum adc_instance {ADC0, ADC1} adc_instance;

typedef struct adc_conf {
  uint32_t adc;
  uint32_t vref_ext; //Voltage reference select; 0 for VDDA, 1 for VREFA+.
  uint32_t adc_clksrc;
  uint32_t vco_div;
  bool initialized;

  adc_conf()
  {
    adc = 0; //consts that fill this are never 0
  }
} adc_conf;

//Check spmu298 for valid sequence trigger sources

typedef struct seq_conf {
  uint32_t adc;
  uint32_t nsh[8]; //Sample and hold time in clock cycles.
  uint32_t sequencer;
  uint32_t trigger;
  uint32_t priority;
  uint32_t len;
  uint32_t chanseq[8]; //Sequence of channels to do conversions on when sequencer is triggered. Array is length of sequencer 0. Must set any unused sequence steps to 0xFF.
  uint32_t step_ints[8];
  uint32_t results[8];
  uint64_t lastTimestamp;

  seq_conf()
  {
    lastTimestamp = 0;
    adc = 0; //consts that fill this are never 0
  }
} seq_conf;

static seq_conf Adc0S0, Adc0S1, Adc0S2, Adc0S3, Adc1S0, Adc1S1, Adc1S2, Adc1S3;
static adc_conf Adc0, Adc1;
static uint32_t seqDelayFactor_us = SEQ_DELAY_FACTOR_MICROS;

//Valid inputs:
//config must be an uninitialized adc_conf. The function will fill out this structure for you.
//adc must be ADC0 or ADC1 as per the adc_instance enum. The definition of this may be different on other platforms with a different number of ADC modules.
//vco_div is the factor by which to divide the ADC's clock if the PLL is used as an input. THIS MUST PRODUCE A CLOCK OF 32MHz OR LESS, or the function will fail.
//adc_clksrc is one of PLLVCO, ALTCLK, PIOSC, or MOSC, as defined above. See the tm4c1294ncpdt user's guide for more information.
static bool adcInit(adc_conf& config, adc_instance adc, bool vref_ext, uint32_t vco_div, uint32_t adc_clksrc);

//Valid inputs:
//config must be an uninitialized seq_conf. The function will fill out this structure for you.
//adc must be ADC0 or ADC1 as per the adc_instance enum, and must correspond to an ADC you configured before with adc_init.
//len is the number of valid items in the array (i.e. how many channels total are in your sequence?). This must be 8 or less. The function will error if you specify a length no currently unused sequencer can handle.
//chans must be a pointer to an array of up to 8 channel numbers from 0 to 19. See the tm4c1294ncpdt user's guide for information on what channels map to what pin.
bool adcSeqInit(seq_conf& config, adc_conf& adc_info, uint8_t sequencerNum, uint32_t len, uint8_t* channels, bool* interrupts, uint32_t* nsh, uint32_t trigger, uint32_t priority);

static bool adcStartConv(seq_conf& config);

static bool adcGetConvResult(seq_conf& config);

static uint8_t getVcoDiv(const uint32_t targetSpeed);

static void addAdcChannel(uint8_t channel, seq_conf *seq, uint8_t chanseqFifoIndex, bool endOfSequence);

//*****************************************************************************************//
//*****************************************************************************************//
//        adcInit - Initialize a chosen ADC  and fill out a struct with info about it      //
//*****************************************************************************************//
//*****************************************************************************************//

bool adcInit(adc_conf& config, adc_instance adc, bool vref_ext, uint32_t vco_div, uint32_t adc_clksrc) { //make adc an enum; change sequencer to just length of FIFO
  uint32_t sysctl_adc;
  config.adc = adc ? ADC1_BASE : ADC0_BASE;
  sysctl_adc = adc ? SYSCTL_PERIPH_ADC1 : SYSCTL_PERIPH_ADC0;
  switch(adc_clksrc) {
    case PLLVCO:
      if((getCpuClockFreq() / vco_div) > 32e6) {
        return false;
      }
      config.adc_clksrc = ADC_CLOCK_SRC_PLL;
      config.vco_div = vco_div;
      break;
    case PIOSC:
      config.adc_clksrc = ADC_CLOCK_SRC_PIOSC; //Fail if vco_div != 1 instead of silently ignoring it
      if(vco_div != 1) {
        return false;
      }
      else {
      config.vco_div = 1;
      }
      break;
    case MOSC:
      config.adc_clksrc = ADC_CLOCK_SRC_MOSC;
      if(vco_div != 1) {
        return false;
      }
      else {
      config.vco_div = 1;
      }
      break;
  }

  config.vref_ext = vref_ext ? ADC_REF_EXT_3V : ADC_REF_INT;

  SysCtlPeripheralEnable(sysctl_adc);
  while(!SysCtlPeripheralReady(sysctl_adc));  //Accessing anything ADC-related before the peripheral is enabled is a bus fault.

  ADCClockConfigSet(config.adc, (config.adc_clksrc | ADC_CLOCK_RATE_FULL), config.vco_div);

  //Change to external voltage reference if requested.
  ADCReferenceSet(ADC0_BASE, config.vref_ext);
  return true;
}


//*****************************************************************************************//
//*****************************************************************************************//
// adcSeqInit - Initialize a chosen ADC sequencer and fill out a struct with info about it //
//*****************************************************************************************//
//*****************************************************************************************//


//The available clock sources are PIOSC, MOSC, and PLLVCO. The scaling factor only matters for PLLVCO and MUST scale it down to
//32MHz or lower for correct operation. MOSC and PIOSC cannot be scaled. PIOSC 16MHz gives 1 Msps, divided PLLVCO at 32MHz gives 2Msps.
//However, with the roveboard default of 120MHz PLL, it is impossible to divide to anything valid above 30MHz, as only integer divisors
//from 1 to 64 are supported (6-bit bitfield).



bool adcSeqInit(seq_conf& config, adc_conf& adc_info, uint8_t sequencerNum, uint32_t len, uint8_t* channels, bool* interrupts, uint32_t* nsh, uint32_t trigger, uint32_t priority) { //TODO: Allow specification of dcon/dma interrupts too.
  uint32_t i;
  config.adc = adc_info.adc;
  switch(len) {
    case 1:
      //Try sequencers starting with the smallest. If they're in use or don't fit the sequence length, go on.
      if(!(HWREG(config.adc + ADC_O_ACTSS) & ADC_ACTSS_ASEN3)) {
        config.sequencer = 3;
        break;
      }
    case 2:
    case 3:
    case 4:
      if(!(HWREG(config.adc + ADC_O_ACTSS) & ADC_ACTSS_ASEN2) && sequencerNum == 2) {
        config.sequencer = 2;
        break;
      }
      else if(!(HWREG(config.adc + ADC_O_ACTSS) & ADC_ACTSS_ASEN1) && sequencerNum == 1) {
        config.sequencer = 1;
        break;
      }
    case 5:
    case 6:
    case 7:
    case 8:
      if(!(HWREG(config.adc + ADC_O_ACTSS) & ADC_ACTSS_ASEN0)) {
        config.sequencer = 0;
        break;
      }
    default:
      return false; //No suitable sequencers available.

