MissouriMRDT/BMS_Software/libraries/RoveBoard/tm4c1294ncpdt_API/RoveADC/RoveADC_TivaTM4C1294NCPDT.cpp
  }

  for(i = 0; i < len; i++)
  {
    if(channels[i] < MAX_CHANS)
    {
      config.chanseq[i]=channels[i];
    }
    else
    {
      return false;
    }
    if(nsh[i] & (nsh[i] - 1))
    {
      return false;
    }
    else
    {
      config.nsh[i] = nsh[i];
    }
    if(interrupts[i])
    {
      config.step_ints[i] = ADC_CTL_IE;
    }
    else
    {
      config.step_ints[i] = 0;
    }
  }

  if((trigger <= ADC_TRIGGER_PWM3) || ((trigger >= ADC_TRIGGER_NEVER) && (trigger <= ADC_TRIGGER_ALWAYS))) {
    config.trigger = trigger;
  }
  else {
    return false;
  }

  if(priority < 8) { //priority only goes up to 7 on tiva
    config.priority = priority;
  }
  else {
    return false;
  }
  //Input checks:
  // -sequencer and sample priority must be 0, 1, 2, or 3
  // -Sample and hold window must be a power of 2 clock cycles long.
  // -Must not configure more samples than the depth of the chosen FIFO
  //Must specify a valid trigger source. See driverlib/adc.h and spmu298.
  // -nsh must be a power of 2.

  //Ensure sequencer is disabled.
  //Configure sequencer, trigger source and priority



  //Enable clock to GPIO modules used. ADC channel numbers map to GPIO ports as follows:
  // -PE: 0-3, 8-9
  // -PD: 4-7, 12-15
  // -PB: 10-11
  // -PK: 16-19
  //
  for(i = 0; i < len; i++) {
    if ((config.chanseq[i] < MAX_CHANS) && (config.chanseq[i] != 4) && (!SysCtlPeripheralReady(adc_chan_sysctl[config.chanseq[i]]))) {
      SysCtlPeripheralEnable(adc_chan_sysctl[config.chanseq[i]]);
    }
    else if (config.chanseq[i] == 4) { //Channel 4 is PD7, which is locked for commit by default and must be freed.
      if(!((GPIO_PORTD_BASE + GPIO_O_CR) & GPIO_PIN_7)) {
        HWREG(GPIO_PORTD_BASE + GPIO_O_LOCK) = GPIO_LOCK_KEY;
        HWREG(GPIO_PORTD_BASE + GPIO_O_CR) |= GPIO_PIN_7;
      }
      if(!SysCtlPeripheralReady(adc_chan_sysctl[4])) {
        SysCtlPeripheralEnable(adc_chan_sysctl[config.chanseq[i]]);
      }
    }
  }


  //Set AFSEL for selected channel pins
  //Disable the analog isolation circuit for the selected channel pins
  for(i = 0; i < len; i++) {
    GPIOPinTypeADC(adc_chan_base[config.chanseq[i]], adc_chan_pin[config.chanseq[i]]);
  }

  ADCSequenceDisable(config.adc, config.sequencer);

  ADCSequenceConfigure(config.adc, config.sequencer, config.trigger, config.priority);

  config.len = len;
  for(i=0; i < config.len - 1; i++) {
    if(config.chanseq[i] == 0xFF) {
      return false;
    }
    ADCSequenceStepConfigure(config.adc, config.sequencer, i, (adc_chans[config.chanseq[i]] | (config.nsh[i] << MAX_CHANS) | (config.step_ints[i])));
  }
  if(config.chanseq[config.len - 1] == 0xFF) {
    return false;
  }
  else {
    ADCSequenceStepConfigure(config.adc, config.sequencer, config.len - 1,
        (adc_chans[config.chanseq[config.len - 1]] | (config.nsh[config.len - 1] << MAX_CHANS) | (config.step_ints[len - 1]) | ADC_CTL_END));
  }

  //Set the interrupt mask bits for the chosen sequence step interrupts.
  /*ADCIntEnableEx(config.adc, adc_int_flags[config.sequencer]); //we don't want an actual interrupt to be generated, we just currently
  if(config.adc == ADC0_BASE) {                                  //use the flag to detect when a conv is complete
    IntEnable(adc0_ints[config.sequencer]);
  }
  else {
    IntEnable(adc1_ints[config.sequencer]);
  }*/
  //Enable the sample sequencer.
  ADCSequenceEnable(config.adc, config.sequencer);
  return true;
}

RoveAdc_Handle roveAdc_init(uint16_t module, uint8_t pin)
{
  uint8_t channel = pin_to_adc_chan[pin];
  uint8_t sequencer;
  uint8_t vcoDiv;
  uint8_t seqLength;
  bool endOfSequence= false;
  uint8_t moduleOffset;
  seq_conf* seqToConf;
  adc_conf *adcToConf;

  if(module > 33)
  {
    debugFault("roveADC_init: module is nonsense");
  }

  else if(channel == NotAChan)
  {
    debugFault("roveADC_init: pin is nonsense");
  }

  //init adc module, if necessary
  if(module < Adc1_Seq0_0)
  {
    if(Adc0.adc == 0) //adc module is just being started
    {
     vcoDiv = getVcoDiv(DEFAULT_ADC_CLK_SPEED);
     adcInit(Adc0, ADC0, false, vcoDiv, PLLVCO);
    }
    else {} //nothing special if the adc module has already been started
  }
  else
  {
    if(Adc1.adc == 0) //adc module is just being started
    {
     vcoDiv = getVcoDiv(DEFAULT_ADC_CLK_SPEED);
     adcInit(Adc1, ADC1, false, vcoDiv, PLLVCO);
    }
    else {} //nothing special if the adc module has already been started
  }

  //get adc sequencer information from module
  if(module <= Adc0_Seq0_7)
  {
    adcToConf = &Adc0;
    seqToConf = &Adc0S0;
    moduleOffset = 0;
    seqLength = SEQ0_LEN;
    sequencer = 0;
    if(module == Adc0_Seq0_7)
    {
      endOfSequence = true;
    }
  }
  else if(module <= Adc0_Seq1_3)
  {
    adcToConf = &Adc0;
    seqToConf = &Adc0S1;
    moduleOffset = Adc0_Seq1_0;
    seqLength = SEQ1_LEN;
    sequencer = 1;
    if(module == Adc0_Seq1_3)
    {
      endOfSequence = true;
    }
  }
  else if(module <= Adc0_Seq2_3)
  {
    adcToConf = &Adc0;
    seqToConf = &Adc0S2;
    moduleOffset = Adc0_Seq2_0;
    seqLength = SEQ2_LEN;
    sequencer = 2;
    if(module == Adc0_Seq2_3)
    {
      endOfSequence = true;
    }
  }
  else if(module <= Adc0_Seq3_0)
  {
    adcToConf = &Adc0;
    seqToConf = &Adc0S3;
    moduleOffset = Adc0_Seq3_0;
    seqLength = SEQ3_LEN;
    sequencer = 3;
    if(module == Adc0_Seq3_0)
    {
      endOfSequence = true;
    }
  }
  else if(module <= Adc1_Seq0_7)
  {
    adcToConf = &Adc1;
    seqToConf = &Adc1S0;
    moduleOffset = Adc1_Seq0_0;
    seqLength = SEQ0_LEN;
    sequencer = 0;
    if(module == Adc1_Seq0_7)
    {
      endOfSequence = true;
    }
  }
  else if(module <= Adc1_Seq1_3)
  {
    adcToConf = &Adc1;
    seqToConf = &Adc1S1;
    moduleOffset = Adc1_Seq1_0;
    seqLength = SEQ1_LEN;
    sequencer = 1;
    if(module == Adc1_Seq1_3)
    {
      endOfSequence = true;
    }
  }
  else if(module <= Adc1_Seq2_3)
  {
    adcToConf = &Adc1;
    seqToConf = &Adc1S2;
    moduleOffset = Adc1_Seq2_0;
    seqLength = SEQ2_LEN;
    sequencer = 2;
    if(module == Adc1_Seq2_3)
    {
      endOfSequence = true;
    }
  }
  else if(module <= Adc1_Seq3_0)
  {
    adcToConf = &Adc1;
    seqToConf = &Adc1S3;
    moduleOffset = Adc1_Seq3_0;
    seqLength = SEQ3_LEN;
    sequencer = 3;
    if(module == Adc1_Seq3_0)
    {
      endOfSequence = true;
    }
  }

  //init adc sequencer or just set a channel if already initted
  if(seqToConf->adc == 0) //sequence just being started
  {
    bool ints[] = {true, true, true, true, true, true, true, true};
    uint32_t sampleHoldTimes[] = {DEFAULT_ADC_SAMPLE_CYCLES, DEFAULT_ADC_SAMPLE_CYCLES, DEFAULT_ADC_SAMPLE_CYCLES, DEFAULT_ADC_SAMPLE_CYCLES,
       DEFAULT_ADC_SAMPLE_CYCLES, DEFAULT_ADC_SAMPLE_CYCLES, DEFAULT_ADC_SAMPLE_CYCLES, DEFAULT_ADC_SAMPLE_CYCLES};
    uint8_t channels[] = {0, 0, 0, 0, 0, 0, 0, 0};
    channels[module - moduleOffset] = channel;

    adcSeqInit(*seqToConf, *adcToConf, sequencer, seqLength, channels, ints, sampleHoldTimes, ADC_TRIGGER_PROCESSOR, 0);
  }
  else //sequencer already started, add another channel
  {
    addAdcChannel(channel, seqToConf, module - moduleOffset, endOfSequence);
  }

