MissouriMRDT/BMS_Software/libraries/RoveBoard/tm4c1294ncpdt_API/RoveADC/RoveADC_TivaTM4C1294NCPDT.cpp
  RoveAdc_Handle handle;
  handle.index = module;
  handle.initialized = true;

  return handle;
}

static uint8_t getVcoDiv(const uint32_t targetSpeed)
{
  uint32_t vcoRate; //either gonna be 320Mhz or 480Mhz
  SysCtlVCOGet(SYSCTL_XTAL_25MHZ, &vcoRate);

  int i;
  for(i = 1; i <= 64; i++) //divider can go up to 64 on this device
  {
    if(targetSpeed >= (vcoRate / i)) //round lower as device can't go above 32Mhz
    {
      return i;
    }
  }

  return 0;
}

static void addAdcChannel(uint8_t channel, seq_conf *seq, uint8_t chanseqFifoIndex, bool endOfSequence)
{
  #ifndef ROVEDEBUG_NO_DEBUG
  if(chanseqFifoIndex > 8)
  {
    debugFault("Drue you dumbass you didn't constrain inputs properly");
  }
  #endif

  seq->chanseq[chanseqFifoIndex] = channel;

  if(seq->chanseq[chanseqFifoIndex] == 4)  //Channel 4 is PD7, which is locked for commit by default and must be freed.
  {
    if(!((GPIO_PORTD_BASE + GPIO_O_CR) & GPIO_PIN_7))
    {
      HWREG(GPIO_PORTD_BASE + GPIO_O_LOCK) = GPIO_LOCK_KEY;
      HWREG(GPIO_PORTD_BASE + GPIO_O_CR) |= GPIO_PIN_7;
    }
  }

  SysCtlPeripheralEnable(adc_chan_sysctl[seq->chanseq[chanseqFifoIndex]]);

  GPIOPinTypeADC(adc_chan_base[seq->chanseq[chanseqFifoIndex]], adc_chan_pin[seq->chanseq[chanseqFifoIndex]]);

  ADCSequenceDisable(seq->adc, seq->sequencer);

  ADCSequenceConfigure(seq->adc, seq->sequencer, seq->trigger, seq->priority);

  uint8_t seqEnd;
  if(endOfSequence)
  {
    seqEnd = ADC_CTL_END;
  }
  else
  {
    seqEnd = 0;
  }

  ADCSequenceStepConfigure(seq->adc, seq->sequencer, chanseqFifoIndex,
      (adc_chans[seq->chanseq[chanseqFifoIndex]] | (seq->nsh[chanseqFifoIndex] << MAX_CHANS) | (seq->step_ints[chanseqFifoIndex] | seqEnd)));

  ADCSequenceEnable(seq->adc, seq->sequencer);
}

bool adcStartConv(seq_conf& config)
{
  //Check if the FIFO is full; clear it out if so
  if(HWREG(config.adc + adc_ssfstat[config.sequencer]) & ADC_SSFSTAT0_FULL) {
    ADCSequenceDataGet(config.adc, config.sequencer, config.results);
  }

  ADCIntClear(config.adc, config.sequencer);
  ADCProcessorTrigger(config.adc, config.sequencer);

  SysCtlDelay(100); //processor never starts conversion without it for some reason.
  return true;
}

bool adcGetConvResult(seq_conf& config)
{
  //Check if the sequencer has completed its transaction yet.
  //If so,
  //Get the sequencer's data and put it into the specified buffer.
  //ADCSequnceDataGet returns number of samples extracted from the FIFO. If this doesn't match the configured length of the sequence, you got the data before it was ready, or messed up something else.
  if(ADCIntStatus(config.adc, config.sequencer, false) > 0)
  {
    ADCIntClear(config.adc, config.sequencer);
    if(ADCSequenceDataGet(config.adc, config.sequencer, config.results) != config.len)
    {
      return false;
    }
    else
    {
      return true;
    }
  }
  else
  {
    return false;
  }
}

RoveAdc_Error roveAdc_getConvResults(RoveAdc_Handle handle, uint32_t *retBuff)
{
  if(handle.initialized == false)
  {
    debugFault("roveAdc_getConvResults: Handle not initialized");
  }
  uint8_t moduleOffset;
  seq_conf *seq;

  uint8_t module = handle.index;

  //get adc sequencer information from module
  if(module <= Adc0_Seq0_7)
  {
    seq = &Adc0S0;
    moduleOffset = 0;
  }
  else if(module <= Adc0_Seq1_3)
  {
    seq = &Adc0S1;
    moduleOffset = Adc0_Seq1_0;
  }
  else if(module <= Adc0_Seq2_3)
  {
    seq = &Adc0S2;
    moduleOffset = Adc0_Seq2_0;
  }
  else if(module <= Adc0_Seq3_0)
  {
    seq = &Adc0S3;
    moduleOffset = Adc0_Seq3_0;
  }
  else if(module <= Adc1_Seq0_7)
  {
    seq = &Adc1S0;
    moduleOffset = Adc1_Seq0_0;
  }
  else if(module <= Adc1_Seq1_3)
  {
    seq = &Adc1S1;
    moduleOffset = Adc1_Seq1_0;
  }
  else if(module <= Adc1_Seq2_3)
  {
    seq = &Adc1S2;
    moduleOffset = Adc1_Seq2_0;
  }
  else if(module <= Adc1_Seq3_0)
  {
    seq = &Adc1S3;
    moduleOffset = Adc1_Seq3_0;
  }

  //if enough time has passed to where we want to take another snapshot with this sequencer,
  //or if the timer has rolled over, then run the adc conversion. Else, the data from the last
  //conversion is fine according to the application. We do this so that the application can take advanatage
  //of the fact that the conversion technically takes the values of several different channels at once to optimize time usage
  uint32_t currentTimestamp = micros();
  if(abs((int64_t)(currentTimestamp - seq->lastTimestamp)) > seqDelayFactor_us || seq->lastTimestamp == 0)
  {
    if(currentTimestamp - seq->lastTimestamp > 1000) //got hung up, restart it and return previous result.
    {
      adcStartConv(*seq);
    }
    if(adcGetConvResult(*seq) == false)
    {
      return ROVEADC_INCOMPLETE_CONVERSION;
    }
    else
    {
      seq->lastTimestamp = currentTimestamp;
    }
  }

  *retBuff = seq->results[module - moduleOffset];
  return ROVEADC_SUCCESS;
}

RoveAdc_Error roveAdc_startConversion(RoveAdc_Handle handle)
{
  if(handle.initialized == false)
  {
   debugFault("roveAdc_startConversion: Handle not initialized");
  }
  seq_conf *seq;

  uint8_t module = handle.index;

  //get adc sequencer information from module
  if(module <= Adc0_Seq0_7)
  {
   seq = &Adc0S0;
  }
  else if(module <= Adc0_Seq1_3)
  {
   seq = &Adc0S1;
  }
  else if(module <= Adc0_Seq2_3)
  {
   seq = &Adc0S2;
  }
  else if(module <= Adc0_Seq3_0)
  {
   seq = &Adc0S3;
  }
  else if(module <= Adc1_Seq0_7)
  {
   seq = &Adc1S0;
  }
  else if(module <= Adc1_Seq1_3)
  {
   seq = &Adc1S1;
  }
  else if(module <= Adc1_Seq2_3)
  {
   seq = &Adc1S2;
  }
  else if(module <= Adc1_Seq3_0)
  {
   seq = &Adc1S3;
  }

  adcStartConv(*seq);
  return ROVEADC_SUCCESS;
}

void setSequenceConversionDeadband(uint32_t deadband_us)
{
  seqDelayFactor_us = deadband_us;
}

float roveAdc_toVolts(uint32_t result)
{
  float _result = result;

  return _result * 3.3 / 4095.0; //voltage = (adc reading) * (system voltage / adc resolution). Adc is 12 bit, so resolution is 2^12 - 1
}

//not currently used
/*
static void adc0Isr0()
{

}
static void adc0Isr1()
{

}
static void adc0Isr2()
{

}
static void adc0Isr3()
{

}
static void adc1Isr0()
{

}
static void adc1Isr1()
{

}
static void adc1Isr2()
{

}
static void adc1Isr3()
{

}*/
